from enum import Enum
from typing import Dict, List


class GoodsCategory(Enum):
    """商品类别枚举"""
    PERSONAL_CARE = ("5", "个护家清", "1", "0")
    SPORTS_OUTDOOR = ("18", "运动户外", "1", "0")
    FOOD_BEVERAGE = ("13", "食品饮料", "1", "0")
    CLOTHING = ("4", "服饰内衣", "1", "0")
    MOTHER_BABY_PET = ("10", "母婴宠物", "1", "0")
    BEAUTY = ("9", "美妆", "1", "0")
    SHOES_BAGS = ("16", "鞋靴箱包", "1", "0")
    WATCHES_ACCESSORIES = ("19", "钟表配饰", "1", "0")
    BOOKS_EDUCATION = ("15", "图书教育", "1", "0")
    SMART_HOME = ("7", "智能家居", "1", "0")
    DIGITAL_APPLIANCES = ("14", "3C数码家电", "1", "0")
    FLOWERS_GARDENING = ("11", "鲜花园艺", "1", "0")
    TOYS_INSTRUMENTS = ("2", "玩具乐器", "1", "0")
    FRESH_FOOD = ("8", "生鲜", "1", "0")
    VIRTUAL_RECHARGE = ("17", "虚拟充值", "1", "0")
    LOCAL_LIFE = ("12", "本地生活", "1", "0")
    JEWELRY = ("20", "珠宝文玩", "1", "0")

    # 个护家清子类别
    # 洗护清洁类
    CLEANING_CARE = ("20115", "洗护清洁", "3", "5")
    ELDERLY_CARE = ("21777", "中老年护理用品", "3", "20115")
    DISINFECTION = ("33702", "消毒用品", "3", "20115")
    HOME_CLEANING = ("21778", "家庭环境清洁剂", "3", "20115")
    FURNITURE_CARE = ("21765", "家私/皮具护理品", "3", "20115")
    PEST_CONTROL = ("21772", "驱虫用品", "3", "20115")
    CLOTHING_CARE = ("21776", "衣物清洁剂/护理剂", "3", "20115")
    PAPER_WIPES = ("21763", "纸品/湿巾", "3", "20115")
    DEODORIZER = ("21775", "室内除臭/芳香用品", "3", "20115")
    CLEANING_FOAM = ("21766", "清洁泡泡/慕斯", "3", "20115")

    # 假发配件类
    WIG_ACCESSORIES = ("38014", "假发配件", "3", "5")
    WIGS = ("38015", "假发", "3", "38014")
    WIG_PARTS = ("38016", "假发配件", "3", "38014")

    # 个人护理类
    PERSONAL_CARE_SUB = ("20056", "个人护理", "3", "5")
    BODY_CARE = ("21197", "身体护理", "3", "20056")
    PERSONAL_CARE_TOOLS = ("21191", "个护用具", "3", "20056")
    AROMATHERAPY = ("21384", "身体精油芳疗", "3", "20056")
    FEMININE_CARE = ("21181", "卫生巾/私处护理", "3", "20056")
    FOOT_CARE = ("21196", "足部护理", "3", "20056")
    HAND_CARE = ("21193", "手部护理", "3", "20056")
    MENS_HAIR_CARE = ("21444", "男士美发护发", "3", "20056")
    HAIR_STYLING = ("21335", "染发烫发/头发造型", "3", "20056")
    MENS_BODY_CARE = ("21383", "男士身体护理", "3", "20056")
    HAIR_CARE = ("21194", "洗发护发", "3", "20056")
    BODY_CLEANING = ("21198", "身体清洁", "3", "20056")
    ORAL_CARE = ("21192", "口腔护理", "3", "20056")
    LIP_BALM = ("32630", "润唇膏", "3", "20056")

    # 运动户外子类别
    # 旅行户外类
    TRAVEL_OUTDOOR = ("20026", "旅行户外", "3", "18")
    OUTDOOR_SHOES = ("20531", "户外鞋靴", "3", "20026")
    SURFING = ("20502", "冲浪/滑水/帆板", "3", "20026")
    SKI_EQUIPMENT = ("20533", "滑雪装备", "3", "20026")
    TENT_EQUIPMENT = ("20504", "帐篷/天幕/帐篷配件", "3", "20026")
    NAVIGATION = ("20505", "通讯/导航/户外表类", "3", "20026")
    BINOCULARS = ("20524", "望远镜/夜视仪/户外眼镜", "3", "20026")
    OUTDOOR_FURNITURE = ("20545", "户外休闲家具", "3", "20026")
    SLEEPING_BAG = ("20491", "睡袋", "3", "20026")
    CAMPING_MAT = ("20522", "防潮垫/地席/枕头", "3", "20026")
    HIKING_POLES = ("20521", "登山杖/手杖", "3", "20026")
    CLIMBING = ("20548", "登山攀岩攀冰", "3", "20026")
    OUTDOOR_CLOTHING = ("20529", "户外服装", "3", "20026")
    WATER_EQUIPMENT = ("20542", "饮水用具/盛水容器", "3", "20026")
    KNIVES_TOOLS = ("20511", "刀具/多用工具", "3", "20026")
    CLEANING_SUPPLIES = ("20541", "洗漱清洁/护理用品", "3", "20026")
    DIVING = ("20534", "潜水装备", "3", "20026")
    FISHING = ("20528", "垂钓装备", "3", "20026")
    OUTDOOR_DINING = ("20546", "户外餐饮用品", "3", "20026")
    MILITARY = ("20540", "军迷服饰/军迷用品", "3", "20026")
    BOATS = ("20532", "水上船艇", "3", "20026")
    TRAVEL_EQUIPMENT = ("20547", "旅行便携装备", "3", "20026")
    OUTDOOR_LIGHTING = ("20530", "户外照明", "3", "20026")
    SAFETY_EQUIPMENT = ("20512", "防护/救生装备", "3", "20026")

    # 运动健身类
    SPORTS_FITNESS = ("20027", "运动健身", "3", "18")
    SPORTS_PROTECTION = ("36924", "运动护具", "3", "20027")
    SWIMMING = ("20497", "游泳", "3", "20027")
    BASKETBALL = ("20499", "篮球", "3", "20027")
    SMALL_FITNESS = ("20527", "踏步机/中小型健身器材", "3", "20027")
    PLAYGROUND = ("20525", "游乐场/体育场馆设施", "3", "20027")
    OTHER_SPORTS = ("20549", "其它运动用品", "3", "20027")
    YOGA = ("20498", "瑜伽", "3", "20027")
    SKATING = ("20508", "轮滑/滑板/极限运动", "3", "20027")
    TENNIS = ("20500", "网球", "3", "20027")
    RUNNING = ("20513", "慢跑/有氧运动", "3", "20027")
    EMERGENCY = ("20551", "运动紧急用品", "3", "20027")
    SPORTS_GOODS = ("34048", "运动用品", "3", "20027")
    INDOOR_GAMES = ("20514", "飞镖/桌上足球/室内休闲", "3", "20027")
    FOLK_SPORTS = ("20507", "毽子/空竹/民间运动", "3", "20027")
    MARTIAL_ARTS = ("20523", "跆拳道/武术/搏击", "3", "20027")
    ARCHERY = ("20494", "射箭", "3", "20027")
    PINGPONG = ("20515", "乒乓球", "3", "20027")
    DANCE = ("20510", "舞蹈/健美操/体操", "3", "20027")
    CHESS_CARDS = ("20503", "麻将/棋牌/益智类", "3", "20027")
    VOLLEYBALL = ("20495", "排球", "3", "20027")
    ICE_SPORTS = ("20506", "冰球/速滑/冰上运动", "3", "20027")
    GOLF = ("20520", "高尔夫", "3", "20027")
    SPORTS_SOUVENIRS = ("20543", "赛事纪念品", "3", "20027")
    REFEREE = ("34047", "裁判/教练用品", "3", "20027")
    DANCE_MAT = ("20519", "跳舞毯", "3", "20027")
    TRACK_FIELD = ("20550", "田径运动器材", "3", "20027")
    BADMINTON = ("20518", "羽毛球", "3", "20027")
    BASEBALL = ("20496", "棒球", "3", "20027")
    LARGE_FITNESS = ("20526", "跑步机/大型健身器械", "3", "20027")
    BILLIARDS = ("20492", "台球", "3", "20027")
    EQUESTRIAN = ("20538", "马术运动", "3", "20027")
    FENCING = ("20535", "击剑运动", "3", "20027")
    FOOTBALL = ("20501", "足球", "3", "20027")

    # 背包配件类
    BAG_ACCESSORIES = ("20052", "背包配件", "3", "18")
    SPORTS_BAG = ("20863", "运动鼓包/旅行包", "3", "20052")
    BAG_GLOVES = ("20839", "手套", "3", "20052")
    SPORTS_JEWELRY = ("20860", "运动首饰", "3", "20052")
    WALLET = ("20861", "钱包卡套", "3", "20052")
    WAIST_BAG = ("20840", "腰包", "3", "20052")
    GAITERS = ("20848", "雪套/套脚", "3", "20052")
    SPORTS_CAP = ("20852", "运动帽", "3", "20052")
    HANDBAG = ("20838", "手包", "3", "20052")
    INSOLES = ("20843", "鞋垫", "3", "20052")
    LEG_WARMERS = ("20842", "腿套", "3", "20052")
    SPORTS_SOCKS = ("20853", "运动袜", "3", "20052")
    WATERPROOF_BAG = ("20862", "防水箱包", "3", "20052")
    CAMERA_BAG = ("20864", "户外摄影包", "3", "20052")
    CASUAL_BAG = ("20850", "挎包/拎包/休闲包", "3", "20052")
    BACKPACK = ("20856", "双肩背包", "3", "20052")
    PATCHES = ("20851", "贴章/魔术贴章", "3", "20052")
    BAG_BELT = ("20841", "腰带", "3", "20052")
    RAINWEAR = ("20849", "雨衣/雨裤/雨披", "3", "20052")
    STORAGE_BAG = ("20865", "收纳配件包", "3", "20052")
    SHOULDER_BAG = ("20855", "单肩背包", "3", "20052")
    RAIN_COVER = ("20854", "防雨罩/背包配件", "3", "20052")
    HEAD_WEAR = ("20847", "头巾/遮耳", "3", "20052")

    # 运动服类
    SPORTS_WEAR = ("20053", "运动服", "3", "18")
    SPORTS_UNDERWEAR = ("20872", "运动内衣", "3", "20053")
    SPORTS_TSHIRT = ("20867", "运动T恤", "3", "20053")
    SKIN_SUIT = ("36789", "皮肤衣", "3", "20053")
    SPORTS_DOWN = ("20881", "运动羽绒服", "3", "20053")
    SPORTS_HOODIE = ("20880", "运动卫衣/套头衫", "3", "20053")
    RUNNING_WEAR = ("20868", "跑步服", "3", "20053")
    SPORTS_UNIFORM = ("20875", "运动球服", "3", "20053")
    FITNESS_WEAR = ("20871", "健身服装", "3", "20053")
    SPORTS_SUIT = ("20873", "运动套装", "3", "20053")
    SPORTS_JACKET = ("20879", "运动茄克/外套", "3", "20053")
    SPORTS_PANTS = ("20870", "运动裤", "3", "20053")
    SPORTS_VEST = ("20877", "运动马甲", "3", "20053")
    SPORTS_SWEATER = ("20878", "运动毛衣/线衫", "3", "20053")
    SPORTS_SKIRT = ("20869", "运动裙", "3", "20053")
    SPORTS_COTTON = ("20874", "运动棉衣", "3", "20053")
    SPORTS_POLO = ("20866", "运动POLO衫", "3", "20053")
    SPORTS_WINDBREAKER = ("20876", "运动风衣", "3", "20053")

    # 运动鞋类
    SPORTS_SHOES = ("20046", "运动鞋", "3", "18")
    CANVAS_SHOES = ("20736", "帆布鞋", "3", "20046")
    SPORTS_SLIPPERS = ("20762", "运动拖鞋", "3", "20046")
    CASUAL_SHOES = ("20716", "板鞋/休闲鞋", "3", "20046")
    SOCCER_SHOES = ("20742", "足球鞋", "3", "20046")
    BADMINTON_SHOES = ("20761", "羽毛球鞋", "3", "20046")
    RUNNING_SHOES = ("20743", "跑步鞋", "3", "20046")
    BASKETBALL_SHOES = ("20739", "篮球鞋", "3", "20046")
    TENNIS_SHOES = ("20740", "网球鞋", "3", "20046")
    TRAINING_SHOES = ("20801", "综合训练鞋/室内健身鞋", "3", "20046")
    DAD_SHOES = ("20741", "老爹鞋", "3", "20046")
    PINGPONG_SHOES = ("20760", "乒乓球鞋", "3", "20046")
    OTHER_SHOES = ("20798", "其它运动鞋", "3", "20046")
    WALKING_SHOES = ("20735", "健步鞋", "3", "20046")
    BEACH_SHOES = ("20799", "运动沙滩鞋/凉鞋", "3", "20046")

    # 骑行工具类
    CYCLING_TOOLS = ("20054,20051", "骑行工具", "3", "18")
    BIKE_PARTS = ("20883", "自行车零/配件", "3", "20054,20051")
    BIKE_TOOLS = ("20886", "自行车修车工具", "3", "20054,20051")
    CYCLING_WEAR = ("20884", "骑行服饰/骑行装备", "3", "20054,20051")
    BICYCLE = ("20885", "自行车整车", "3", "20054,20051")
    BIKE_EQUIPMENT = ("20882", "自行车/单车装备", "3", "20054,20051")
    EBIKE_PARTS = ("20834", "电动车零/配件", "3", "20054,20051")
    EBIKE = ("20835", "电动车整车", "3", "20054,20051")
    EBIKE_TOOLS = ("20837", "电动车维修工具", "3", "20054,20051")
    EBIKE_EQUIPMENT = ("20836", "电动车装备区", "3", "20054,20051")

    # 零食/坚果/特产类
    SNACKS = ("20018", "零食/坚果/特产", "3", "13")
    PASTRY = ("20312", "糕点/点心/面包", "3", "20018")
    CANDY = ("20354", "糖果零食/果冻/布丁", "3", "20018")
    COOKIES = ("20313", "饼干/膨化", "3", "20018")
    OTHER_SNACKS = ("20310", "其它", "3", "20018")
    MEAT_SNACKS = ("20333", "肉干肉脯/熏腊卤味/肉类熟食", "3", "20018")
    LOCAL_SPECIALTY = ("20351", "地方特产", "3", "20018")
    CHOCOLATE = ("20329", "巧克力", "3", "20018")
    NUTS = ("20331", "山核桃/坚果/炒货", "3", "20018")
    SEAFOOD_SNACKS = ("20332", "即食水产/海味零食", "3", "20018")
    BEAN_PRODUCTS = ("20355", "豆干制品/蔬菜干", "3", "20018")
    DRIED_FRUITS = ("20314", "蜜饯/果干/水果制品", "3", "20018")

    # 粮油米面/南北干货/调味品类
    FOOD_INGREDIENTS = ("20104,20017", "粮油米面/南北干货/调味品", "3", "13")
    INSTANT_FOOD = ("21675", "方便速食/冷藏食品", "3", "20104,20017")
    BAKING_MATERIALS = ("21673", "烘焙原料/辅料/食品添加剂", "3", "20104,20017")
    LIGHT_MEAL = ("32987", "轻食简餐", "3", "20104,20017")
    GRAINS = ("21664", "米/面粉/杂粮", "3", "20104,20017")
    CONDIMENTS = ("21665", "调味品/果酱/沙拉", "3", "20104,20017")
    DRIED_GOODS = ("21674", "南北干货/肉类干货", "3", "20104,20017")
    OTHER_FOODS = ("21672", "其他食品", "3", "20104,20017")
    COOKING_OIL = ("21666", "食用油/调味油", "3", "20104,20017")
    CHEESE = ("20319", "奶酪/奶制品", "3", "20104,20017")
    BEVERAGES = ("20309", "饮料", "3", "20104,20017")
    DAIRY = ("20328", "乳制品", "3", "20104,20017")
    INSTANT_DRINKS = ("20318", "藕粉/麦片/冲饮品", "3", "20104,20017")
    FAMILY_MILK = ("20349", "全家营养奶粉", "3", "20104,20017")
    NUTRITION_POWDER = ("20350", "食补粉", "3", "20104,20017")
    CAMEL_MILK = ("20364", "驼奶及驼奶粉", "3", "20104,20017")
    COFFEE = ("20356", "速溶咖啡/咖啡豆/粉", "3", "20104,20017")
    ICE_CREAM = ("32256", "冰淇淋", "3", "20104,20017")

    # 茶类
    TEA = ("20004", "茶", "3", "13")
    SPECIAL_TEA = ("38940", "特色茶", "3", "20004")
    PUER_TEA = ("20159", "普洱", "3", "20004")
    HERBAL_TEA = ("20166", "代用/花草/水果/再加工茶", "3", "20004")
    GREEN_TEA = ("20162", "绿茶", "3", "20004")
    WHITE_TEA = ("20160", "白茶", "3", "20004")
    AGED_TEA = ("34845", "年份茶", "3", "20004")
    OOLONG_TEA = ("20167", "乌龙茶", "3", "20004")
    BLACK_TEA = ("20161", "红茶", "3", "20004")
    DARK_TEA = ("20164", "黑茶", "3", "20004")
    TEA_GIFT_BOX = ("32206", "多品种茶叶礼盒", "3", "20004")
    YELLOW_TEA = ("20163", "黄茶", "3", "20004")

    # 女装类
    WOMENS_CLOTHING = ("20005", "女装", "3", "4")
    JUMPSUITS = ("20240", "连体衣/裤", "3", "20005")
    WOMENS_POLO = ("20169", "POLO衫", "3", "20005")
    FUR_CLOTHING = ("39052", "皮草", "3", "20005")
    PLUS_SIZE = ("20245", "大码女装", "3", "20005")
    DRESSES = ("20224", "连衣裙", "3", "20005")
    SHORTS = ("20178", "短裤", "3", "20005")
    TANK_TOPS = ("20248", "背心吊带", "3", "20005")
    ELDERLY_CLOTHING = ("20265", "中老年女装", "3", "20005")
    PANTS = ("20180", "裤子", "3", "20005")
    COTTON_CLOTHING = ("20211", "棉衣/棉服", "3", "20005")
    TRENCH_COAT = ("20182", "风衣", "3", "20005")
    VEST = ("20183", "马夹", "3", "20005")
    CASHMERE = ("20222", "羊绒衫", "3", "20005")
    SWEATER = ("20175", "毛衣", "3", "20005")
    WOOL_COAT = ("20246", "毛呢外套", "3", "20005")
    UNIFORMS = ("20218", "套装/学生校服/工作制服", "3", "20005")
    KNITWEAR = ("20247", "毛针织衫", "3", "20005")
    DOWN_JACKET = ("20223", "羽绒服", "3", "20005")
    LACE_TOPS = ("20242", "蕾丝衫/雪纺衫", "3", "20005")
    SUIT = ("20181", "西装", "3", "20005")
    TSHIRT = ("20171", "T恤", "3", "20005")
    SKIRT = ("20219", "半身裙", "3", "20005")
    FORMAL_DRESS = ("20215", "婚纱/旗袍/礼服", "3", "20005")
    HOODIE = ("20210", "卫衣/绒衫", "3", "20005")
    WOOL_SWEATER = ("20221", "羊毛衫", "3", "20005")
    SHIRT = ("20179", "衬衫", "3", "20005")
    LEATHER_JACKET = ("20177", "皮衣", "3", "20005")
    ETHNIC_COSTUME = ("20217", "唐装/民族服装/舞台服装", "3", "20005")
    DESIGNER_CLOTHING = ("20243", "设计师/潮牌女装", "3", "20005")
    SHORT_COAT = ("20220", "短外套", "3", "20005")

    # 内衣裤袜类
    UNDERWEAR = ("20062", "内衣裤袜", "3", "4")
    CAMISOLE = ("21028", "吊带/背心", "3", "20062")
    UNDERWEAR_ACC = ("21233", "内衣配件", "3", "20062")
    GARTER = ("21087", "吊袜带", "3", "20062")
    THERMAL_UNDERWEAR = ("21232", "保暖内衣", "3", "20062")
    SOCKS = ("20946", "袜子", "3", "20062")
    PANTIES = ("20943", "内裤", "3", "20062")
    TEEN_BRA = ("21235", "少女文胸", "3", "20062")
    SHAPEWEAR = ("21088", "塑身衣", "3", "20062")
    SLEEPWEAR = ("20944", "睡衣", "3", "20062")
    WOMENS_UNDERWEAR = ("21234", "女士内衣", "3", "20062")

    # 男装类
    MENS_CLOTHING = ("20009", "男装", "3", "4")
    MENS_FUR = ("20195", "皮草", "3", "20009")
    DOWN_VEST = ("36965", "羽绒马甲", "3", "20009")
    MENS_VEST = ("36961", "马甲", "3", "20009")
    MENS_SUIT = ("20200", "西服", "3", "20009")
    SWEATPANTS = ("20190", "卫裤", "3", "20009")
    MENS_DOWN = ("20233", "羽绒服", "3", "20009")
    CASUAL_PANTS = ("20229", "休闲裤", "3", "20009")
    MENS_PLUS_SIZE = ("36957", "大码男装", "3", "20009")
    ELDERLY_MENS = ("36959", "中老年男装", "3", "20009")
    MENS_SHIRT = ("20199", "衬衫", "3", "20009")
    MENS_SHORTS = ("20198", "短裤", "3", "20009")
    MENS_TANK = ("20212", "背心", "3", "20009")
    MENS_WOOL_COAT = ("20253", "毛呢大衣", "3", "20009")
    JACKET = ("20191", "夹克", "3", "20009")
    MENS_TSHIRT = ("20172", "T恤", "3", "20009")
    MENS_SET = ("20192", "套装", "3", "20009")
    MENS_WOOL = ("20231", "羊毛衫", "3", "20009")
    MENS_CASHMERE = ("36958", "羊绒衫", "3", "20009")
    LEATHER_PANTS = ("20197", "皮裤", "3", "20009")
    MENS_POLO = ("20170", "Polo衫", "3", "20009")
    DOWN_PANTS = ("20234", "羽绒裤", "3", "20009")
    MENS_LEATHER = ("20196", "皮衣", "3", "20009")
    JEANS = ("20230", "牛仔裤", "3", "20009")
    MENS_TRENCH = ("20201", "风衣", "3", "20009")
    COTTON_PANTS = ("20194", "棉裤", "3", "20009")
    MENS_ETHNIC = ("20254", "民族服装", "3", "20009")
    MENS_HOODIE = ("20189", "卫衣", "3", "20009")
    MENS_SWEATER = ("20241", "针织衫/毛衣", "3", "20009")
    MENS_COTTON = ("20193", "棉衣", "3", "20009")

    # 服饰配件类
    CLOTHING_ACC = ("20093", "服饰配件", "3", "4")
    SUN_PROTECTION = ("32657", "防晒护具", "3", "20093")
    SCARF = ("21508", "围巾/丝巾/披肩", "3", "20093")
    ACCESSORY_SET = ("21510", "围巾/手套/帽子套件", "3", "20093")
    POCKET_SQUARE = ("21512", "口袋巾", "3", "20093")
    SLEEVE_COVER = ("36980", "袖套", "3", "20093")
    SHOE_BELT_ACC = ("21511", "鞋包/皮带配件", "3", "20093")
    ETHNIC_ACC = ("36969", "民族特色服配", "3", "20093")
    DIY_MATERIAL = ("36968", "DIY编织材料包", "3", "20093")
    WEDDING_ACC = ("21522", "婚纱礼服配件", "3", "20093")
    TIE_CLIP = ("21513", "领带夹", "3", "20093")
    HAT = ("21503", "帽子", "3", "20093")
    EAR_MUFF = ("21506", "耳套", "3", "20093")
    SUN_PROTECTION_2 = ("21515", "防晒护具", "3", "20093")
    CLOTHING_GLOVES = ("21504", "手套", "3", "20093")
    CLOTHING_BELT = ("21509", "腰带/皮带/腰链", "3", "20093")
    CUFFLINKS = ("21507", "袖扣", "3", "20093")
    COLLAR_ACC = ("21516", "领部配件", "3", "20093")

    # 儿童床品/家纺类
    CHILDREN_BEDDING = ("34626", "儿童床品/家纺", "3", "10")
    BLANKET = ("34820", "毯子", "3", "34626")
    CHILDREN_SLEEPING_BAG = ("34825", "婴童睡袋/防踢被", "3", "34626")
    BEDDING_SET = ("34828", "婴童多件套", "3", "34626")
    MOSQUITO_NET = ("34822", "婴童蚊帐", "3", "34626")
    QUILT = ("34831", "被子", "3", "34626")
    PILLOW = ("34821", "婴童枕头/枕芯", "3", "34626")
    SWADDLE = ("34826", "抱被", "3", "34626")

    # 婴童用品类
    BABY_PRODUCTS = ("20068", "婴童用品", "3", "10")
    SAFETY_PRODUCTS = ("21034", "防撞/提醒/安全/保护", "3", "20068")
    MOSQUITO_REPELLENT = ("21257", "驱蚊用品", "3", "20068")
    BABY_WIPES = ("20960", "婴儿湿巾", "3", "20068")
    CHILDREN_FURNITURE = ("21159", "儿童房/桌椅/家具", "3", "20068")
    POTTY_TRAINING = ("21402", "宝宝如厕用品", "3", "20068")
    COTTON_TISSUE = ("31982", "婴儿棉柔巾", "3", "20068")
    BABY_DETERGENT = ("21179", "宝宝清洁液/洗衣液/柔顺剂", "3", "20068")
    GROOMING_TOOLS = ("21076", "理发/指甲钳等护理小用品", "3", "20068")
    CAR_SEAT = ("21445", "汽车安全座椅/安全背带", "3", "20068")
    BABY_CARRIER = ("21056", "背带/学步带/出行用品", "3", "20068")
    OTHER_BABY = ("21401", "其它婴童用品", "3", "20068")
    PACIFIER = ("21061", "奶嘴/奶嘴相关", "3", "20068")
    STROLLER = ("21378", "婴儿手推车/学步车", "3", "20068")
    BABY_BED = ("21051", "童床/婴儿床/摇篮/床护栏", "3", "20068")
    BABY_BOTTLE = ("21062", "奶瓶/奶瓶相关", "3", "20068")
    BABY_BATH = ("21256", "宝宝洗浴", "3", "20068")
    BABY_PAPER = ("33017", "母婴用纸", "3", "20068")
    FEEDING_APPLIANCE = ("21045", "消毒/暖奶/喂养小家电", "3", "20068")
    FEEDING_TOOLS = ("21037", "水杯/餐具/研磨/辅食小家电", "3", "20068")
    BEDDING = ("21033", "睡袋/凉席/枕头/床品", "3", "20068")
    BABY_SKINCARE = ("21255", "宝宝护肤", "3", "20068")
    BABY_ORAL_CARE = ("21029", "牙胶/牙刷/牙膏", "3", "20068")

    # 婴童尿裤类
    BABY_DIAPERS = ("20067", "婴童尿裤", "3", "10")
    DIAPER_PAD = ("21115", "纸尿片", "3", "20067")
    DIAPER_ACC = ("21253", "尿裤周边", "3", "20067")
    DISPOSABLE_DIAPER = ("21116", "纸尿裤", "3", "20067")
    SPECIAL_DIAPER = ("21254", "特护尿裤", "3", "20067")
    CLOTH_DIAPER = ("21157", "布尿裤/尿垫", "3", "20067")
    PULL_UP = ("21114", "拉拉裤", "3", "20067")
    OTHER_DIAPER = ("20959", "其他", "3", "20067")

    # 孕产妇用品类
    MATERNITY = ("20055", "孕产妇用品", "3", "10")
    RADIATION_PROTECTION = ("20888", "防辐射", "3", "20055")
    MATERNITY_BELT = ("20894", "束缚带/塑身衣/盆骨带", "3", "20055")
    POSTNATAL_NUTRITION = ("20899", "月子营养", "3", "20055")
    DELIVERY_SUPPLIES = ("20898", "待产用品", "3", "20055")
    NURSING_SUPPLIES = ("20896", "哺乳用品", "3", "20055")
    NURSING_BRA = ("20900", "哺乳文胸/内裤/产检裤", "3", "20055")
    MATERNITY_EXERCISE = ("20905", "孕产妇运动/瑜伽/健身", "3", "20055")
    MATERNITY_NUTRITION = ("20906", "孕产妇营养品", "3", "20055")
    MATERNITY_CLOTHES = ("20887", "孕妇装", "3", "20055")
    MATERNITY_ACC = ("20892", "产妇帽/孕妇袜/孕妇鞋", "3", "20055")
    MATERNITY_MAKEUP = ("20903", "孕产妇彩妆", "3", "20055")
    MOMMY_BAG = ("20890", "妈咪包/背婴带", "3", "20055")
    ORAL_CARE_MAT = ("20907", "孕期口腔护理", "3", "20055")
    MATERNITY_HOME = ("20893", "家居服/哺乳装/秋衣裤", "3", "20055")
    MATERNITY_PANTS = ("20891", "孕妇裤/托腹裤", "3", "20055")
    MATERNITY_SKINCARE = ("20904", "孕产妇护肤/洗护/祛纹", "3", "20055")
    BREAST_PUMP = ("20889", "吸奶器/配件", "3", "20055")

    # 宠物食品/用品/保健品类
    PET_SUPPLIES = ("20041", "宠物食品/用品/保健品", "3", "10")
    PET_HEALTH = ("34980", "猫/狗保健品", "3", "20041")
    CAT_FOOD = ("20688", "猫主粮", "3", "20041")
    DOG_SNACKS = ("20687", "狗零食", "3", "20041")
    CAT_SNACKS = ("20695", "猫零食（新）", "3", "20041")
    DOG_FOOD = ("20686", "犬主粮", "3", "20041")
    PET_SMART = ("20693", "宠物智能设备", "3", "20041")
    BIRD_SUPPLIES = ("20691", "鸟类及用品", "3", "20041")
    PET_TOYS = ("20678", "猫/狗玩具", "3", "20041")
    RABBIT_SUPPLIES = ("20692", "兔类及其用品", "3", "20041")
    LIVESTOCK = ("20698", "畜牧用品（新）", "3", "20041")
    PET_MEDICINE = ("31984", "动物药品及药剂", "3", "20041")
    PET_DAILY = ("20679", "猫/狗日用品", "3", "20041")
    PET_MEDICAL = ("20682", "猫/狗医疗用品（非药品）", "3", "20041")
    OTHER_PETS = ("20689", "其它宠物", "3", "20041")
    PET_GROOMING = ("20681", "猫/狗美容清洁用品", "3", "20041")
    PET_GENERAL = ("20680", "猫/狗通用食品", "3", "20041")
    REPTILE_SUPPLIES = ("20684", "爬虫/鸣虫及其用品", "3", "20041")
    PET_ACC = ("20700", "宠物附属品（新）", "3", "20041")
    PET_CLOTHING = ("20697", "宠物服饰及配件", "3", "20041")
    HAMSTER_SUPPLIES = ("20699", "仓鼠类及其它小宠", "3", "20041")
    AQUARIUM = ("20690", "水族世界", "3", "20041")

    # 婴童鞋靴类
    CHILDREN_SHOES = ("20033", "婴童鞋靴", "3", "10")
    LEATHER_BOOTS = ("20609", "皮靴/棉靴", "3", "20033")
    RAIN_BOOTS = ("20604", "儿童雨衣/雨鞋/雨靴", "3", "20033")
    CHILDREN_WALKING_SHOES = ("20614", "学步鞋", "3", "20033")
    LEATHER_SHOES = ("20603", "皮鞋", "3", "20033")
    PARENT_CHILD = ("20618", "亲子鞋", "3", "20033")
    COTTON_SHOES = ("20602", "棉鞋", "3", "20033")
    BOARD_SHOES = ("20601", "板鞋", "3", "20033")
    CRYSTAL_SHOES = ("35705", "水晶/水钻鞋", "3", "20033")
    CLOTH_SHOES = ("20636", "传统布鞋/手工编织鞋", "3", "20033")
    DANCE_SHOES = ("20620", "舞蹈鞋", "3", "20033")
    CHILDREN_SPORTS_SHOES = ("20621", "运动鞋", "3", "20033")
    CHILDREN_CANVAS_SHOES = ("20619", "帆布鞋", "3", "20033")
    SHOE_ACC = ("20623", "鞋配件", "3", "20033")
    BABY_SHOES = ("20641", "婴儿步前鞋/袜鞋", "3", "20033")
    SLIPPERS = ("20600", "拖鞋", "3", "20033")
    SANDALS = ("20599", "凉鞋", "3", "20033")
    SNOW_BOOTS = ("20622", "雪地靴", "3", "20033")

    # 婴童服饰类
    CHILDREN_CLOTHING = ("20032", "婴童服饰", "3", "10")
    BABY_GIFT = ("20631", "婴儿礼盒", "3", "20032")
    TANK_TOP = ("20632", "背心吊带", "3", "20032")
    BAG = ("24939", "包包", "3", "20032")
    OUTDOOR_WEAR = ("20639", "儿童户外服", "3", "20032")
    ROMPER = ("20625", "连身衣/爬服/哈衣", "3", "20032")
    CHILDREN_SOCKS = ("20633", "儿童袜子(0-16岁)", "3", "20032")
    CAPE = ("20607", "披风/斗篷", "3", "20032")
    SET = ("20594", "套装", "3", "20032")
    ACCESSORIES = ("20630", "儿童配饰", "3", "20032")
    HAT_SCARF = ("20611", "帽子/围巾/口罩/手套/耳套/脚套", "3", "20032")
    ETHNIC_WEAR = ("20634", "儿童旗袍/唐装/民族服装", "3", "20032")
    CHILDREN_SWEATER = ("20613", "毛衣/针织衫", "3", "20032")
    CHILDREN_HOODIE = ("20606", "卫衣/绒衫", "3", "20032")
    CHILDREN_UNDERWEAR = ("20637", "儿童内衣裤", "3", "20032")
    CHILDREN_JEANS = ("20628", "儿童牛仔", "3", "20032")
    BIB = ("20624", "反穿衣/罩衣", "3", "20032")
    LOUNGEWEAR = ("20638", "儿童家居服", "3", "20032")
    FORMAL_WEAR = ("20629", "儿童礼服", "3", "20032")
    FAMILY_WEAR = ("20626", "亲子装/亲子时装", "3", "20032")
    COAT = ("20610", "外套/夹克/大衣", "3", "20032")
    CHILDREN_SHIRT = ("20595", "衬衫", "3", "20032")
    CHILDREN_PANTS = ("20597", "裤子", "3", "20032")
    CHILDREN_VEST = ("20598", "马甲", "3", "20032")
    SWIMWEAR = ("20627", "儿童泳装", "3", "20032")
    DRESS = ("20596", "裙子", "3", "20032")
    CHILDREN_DOWN_JACKET = ("20635", "羽绒服饰/羽绒内胆", "3", "20032")
    COTTON_COAT = ("20608", "棉袄/棉服", "3", "20032")
    POLO = ("20617", "儿童POLO衫", "3", "20032")
    CHILDREN_TSHIRT = ("20592", "T恤", "3", "20032")
    PERFORMANCE = ("20640", "儿童演出服", "3", "20032")
    BELLY_BAND = ("20612", "肚兜/肚围/护脐带", "3", "20032")

    # 奶粉/辅食/营养品/零食类
    BABY_FOOD = ("20028", "奶粉/辅食/营养品/零食", "3", "10")
    BABY_SNACKS = ("20555", "婴童零食", "3", "20028")
    GOAT_MILK_3 = ("20558", "婴幼儿羊奶粉（3段）", "3", "20028")
    CHILDREN_MILK = ("20553", "儿童奶粉", "3", "20028")
    BABY_SEASONING = ("20560", "婴童调味品", "3", "20028")
    OTHER_FOOD = ("20552", "其它", "3", "20028")
    BABY_SUPPLEMENT = ("20554", "宝宝辅食", "3", "20028")
    MILK_POWDER_3 = ("20557", "婴幼儿牛奶粉（3段）", "3", "20028")
    BABY_NUTRITION = ("20559", "婴童营养品", "3", "20028")
    MILK_POWDER_2 = ("36550", "婴幼儿牛奶粉（2段）", "3", "20028")

    # 美容护肤类
    SKINCARE = ("20085,20038", "美容护肤", "3", "9")
    FACIAL_CARE = ("21328", "面部护肤", "3", "20085,20038")
    T_ZONE_CARE = ("20916", "T区护理", "3", "20085,20038")
    SKINCARE_SUN_PROTECTION = ("21006", "防晒", "3", "20085,20038")
    TRAVEL_SIZE = ("33608", "旅行装/体验装", "3", "20085,20038")
    MENS_SKINCARE = ("21325", "男士护肤", "3", "20085,20038")
    EYE_CARE = ("21326", "眼部护理", "3", "20085,20038")
    LIP_CARE = ("21324", "唇部护理", "3", "20085,20038")
    FACIAL_DEVICE = ("32667", "面部美容仪器", "3", "20085,20038")

    # 彩妆香水类
    MAKEUP_PERFUME = ("20029", "彩妆香水", "3", "9")
    FACIAL_TOOLS = ("20673", "面部美容工具", "3", "20029")
    FACIAL_MAKEUP = ("20574", "面部彩妆", "3", "20029")
    PERFUME = ("20562", "香水/香膏", "3", "20029")
    EYE_MAKEUP = ("20571", "眼部彩妆", "3", "20029")
    MENS_PERFUME = ("34071", "男士香水/香膏", "3", "20029")
    OTHER_MAKEUP = ("20566", "其他彩妆", "3", "20029")
    BODY_TOOLS = ("20666", "美体工具", "3", "20029")
    MAKEUP_TOOLS = ("20572", "美妆工具", "3", "20029")
    LIP_MAKEUP = ("20567", "唇部彩妆", "3", "20029")
    MENS_MAKEUP = ("20570", "男士彩妆", "3", "20029")
    MAKEUP_SET = ("20568", "彩妆套装", "3", "20029")
    NAIL_PRODUCTS = ("20565", "指甲油/美甲产品/美甲工具", "3", "20029")

    # 男鞋类
    MENS_SHOES = ("20010", "男鞋", "3", "16")
    MENS_CANVAS = ("20236", "帆布鞋", "3", "20010")
    MENS_LOW_TOP = ("20235", "低帮鞋", "3", "20010")
    MENS_MENS_LEATHER = ("20204", "皮鞋", "3", "20010")
    MENS_RAIN = ("20205", "雨鞋", "3", "20010")
    MENS_SANDALS = ("20202", "凉鞋", "3", "20010")
    MENS_SHOE_ACC = ("20255", "男鞋配件", "3", "20010")
    MENS_BOOTS = ("20206", "靴子", "3", "20010")
    MENS_HIGH_TOP = ("20237", "高帮鞋", "3", "20010")
    MENS_SLIPPERS = ("20203", "拖鞋", "3", "20010")

    # 女鞋类
    WOMENS_SHOES = ("20006", "女鞋", "3", "16")
    WOMENS_BOOTS = ("20187", "靴子", "3", "20006")
    WOMENS_SLIPPERS = ("20185", "拖鞋", "3", "20006")
    WOMENS_LOW_TOP = ("20225", "低帮鞋", "3", "20006")
    WOMENS_HIGH_TOP = ("20227", "高帮鞋", "3", "20006")
    WOMENS_SANDALS = ("20184", "凉鞋", "3", "20006")
    WOMENS_SHOE_ACC = ("20249", "女鞋配件", "3", "20006")
    WOMENS_RAIN = ("20186", "雨鞋", "3", "20006")
    WOMENS_HEELS = ("20228", "高跟鞋", "3", "20006")
    WOMENS_CANVAS = ("20226", "帆布鞋", "3", "20006")

    # 箱包类
    BAGS = ("20011", "箱包", "3", "16")
    MENS_BAGS = ("20258", "男士包袋", "3", "20011")
    CARD_HOLDER = ("20207", "卡套", "3", "20011")
    FUNCTIONAL_BAGS = ("20256", "功能箱包", "3", "20011")
    WOMENS_BAGS = ("20257", "女士包袋", "3", "20011")
    BAG_ACC = ("20267", "箱包相关配件", "3", "20011")

    # 打火机/瑞士军刀/眼镜类
    ACCESSORIES_ACCESSORIES = ("20003", "打火机/瑞士军刀/眼镜", "3", "19")
    FUNCTIONAL_GLASSES = ("20151", "功能眼镜", "3", "20003")
    GLASSES_ACC = ("20158", "眼镜配件、护理剂", "3", "20003")
    SUNGLASSES = ("20152", "太阳眼镜", "3", "20003")
    SMOKING_ACC = ("20148", "烟具", "3", "20003")
    OPTICAL_GLASSES = ("20150", "光学眼镜", "3", "20003")
    LIGHTER = ("20156", "品牌打火机及配件", "3", "20003")

    # 时尚饰品类
    FASHION_ACC = ("20080", "时尚饰品", "3", "19")
    RINGS = ("21024", "戒指/指环", "3", "20080")
    BRACELETS = ("20995", "手链", "3", "20080")
    HAIR_ACC = ("33507", "发饰", "3", "20080")
    BROOCH = ("20999", "胸针", "3", "20080")
    EARRINGS = ("20998", "耳饰", "3", "20080")
    BANGLES = ("20996", "手镯", "3", "20080")
    FASHION_WEDDING_ACC = ("21290", "婚庆饰品", "3", "20080")
    JEWELRY_STORAGE = ("21291", "首饰收纳", "3", "20080")
    DIY_ACC = ("20912", "DIY配件", "3", "20080")
    ANKLETS = ("21000", "脚链", "3", "20080")
    NECKLACES = ("21001", "项链", "3", "20080")
    PENDANTS = ("21025", "项坠/吊坠", "3", "20080")
    GEM_JEWELRY = ("38103", "处理类宝石饰品", "3", "20080")
    SILVER_JEWELRY = ("33694", "银饰", "3", "20080")

    # 钟表类
    WATCHES = ("20047", "钟表类", "3", "19")
    WATCH_ACC = ("20707", "配件", "3", "20047")
    WATCH_WINDER = ("36790", "摇表器", "3", "20047")
    POCKET_WATCH = ("20705", "怀表", "3", "20047")
    WRIST_WATCH = ("20706", "腕表", "3", "20047")

    # 教育音像类
    EDUCATIONAL_AV = ("20078", "教育音像", "3", "15")
    MUSIC_VIDEO = ("21418", "音乐影视音像", "3", "20078")

    # 书籍/杂志/报纸类
    BOOKS = ("20015", "书籍/杂志/报纸", "3", "15")
    MEDICAL = ("20336", "医学卫生", "3", "20015")
    NEWSPAPER = ("20339", "报纸/期刊订阅", "3", "20015")
    NOVEL = ("20300", "小说", "3", "20015")
    COMPUTER = ("20330", "计算机/网络", "3", "20015")
    ART = ("20308", "艺术", "3", "20015")
    LANGUAGE = ("20321", "外语/语言文字", "3", "20015")
    TEXTBOOK = ("20315", "考试/教材/教辅/论文", "3", "20015")
    TRAVEL = ("20303", "旅游", "3", "20015")
    MOTIVATION = ("20353", "自我实现/励志", "3", "20015")
    KNOWLEDGE_SERVICE = ("20342", "知识服务/读书卡", "3", "20015")
    HEALTH_PSYCH = ("20325", "保健/心理类书籍", "3", "20015")
    RELATIONSHIP = ("20359", "婚恋与两性", "3", "20015")
    CULTURE = ("20326", "文化/信息与知识传播", "3", "20015")
    LIFESTYLE = ("20305", "生活", "3", "20015")
    COMICS = ("20317", "漫画/动漫/漫画集", "3", "20015")
    REFERENCE = ("20334", "工具书/百科全书", "3", "20015")
    ECONOMICS = ("20307", "经济", "3", "20015")
    LAW = ("20304", "法律", "3", "20015")
    BIOGRAPHY = ("20296", "传记", "3", "20015")
    HISTORY = ("20298", "历史", "3", "20015")
    SOCIAL_SCIENCE = ("20343", "社会科学", "3", "20015")
    IMPORTED_BOOKS = ("20360", "进口原版书(含港台)", "3", "20015")
    PHILOSOPHY = ("20358", "哲学和宗教", "3", "20015")
    SCIENCE = ("20323", "科学/科学研究", "3", "20015")
    NATURAL_SCIENCE = ("20345", "自然科学", "3", "20015")
    POLITICS = ("20340", "政治军事", "3", "20015")
    LITERATURE = ("20302", "文学", "3", "20015")
    MANAGEMENT = ("20306", "管理", "3", "20015")
    SPORTS = ("20335", "体育运动", "3", "20015")
    MAGAZINES = ("20301", "期刊报纸现刊/单刊/过刊", "3", "20015")
    CHILDREN_BOOKS = ("20352", "儿童读物/童书", "3", "20015")
    CALLIGRAPHY = ("20320", "字帖/练字帖/练字板/毛笔字贴", "3", "20015")
    MAPS = ("20311", "地图/地理", "3", "20015")
    PARENTING = ("20344", "育儿书籍", "3", "20015")
    TECHNOLOGY = ("20322", "工业/农业技术", "3", "20015")
    ENTERTAINMENT = ("20338", "娱乐时尚", "3", "20015")
    BOOK_ACC = ("20337", "图书周边", "3", "20015")
    WEB_NOVEL = ("37861", "网络原创", "3", "20015")
    BOOK_SET = ("20361", "自由组合套装", "3", "20015")
    DAMAGED_BOOKS = ("20327", "残损库存品/外观瑕疵品", "3", "20015")
    FITNESS_HEALTH = ("20357", "健身与保健", "3", "20015")
    OTHER_BOOKS = ("20297", "其他", "3", "20015")

    # 学习用品类
    STUDY_SUPPLIES = ("20069", "学习用品", "3", "15")
    ART_SUPPLIES = ("21043", "画具/画材/书法用品", "3", "20069")
    TEACHING_AIDS = ("21341", "教学演示/展示告示用品", "3", "20069")
    STATIONERY = ("20961", "文具", "3", "20069")
    STUDY_STORAGE = ("34615", "学习收纳/陈列用品", "3", "20069")

    # 餐饮具类
    TABLEWARE = ("20048", "餐饮具", "3", "7")
    DISPOSABLE_TABLEWARE = ("20815", "一次性餐桌用品", "3", "20048")
    CUPS = ("20710", "杯子/水杯/水壶", "3", "20048")
    COFFEE_TOOLS = ("20763", "咖啡器具", "3", "20048")
    DINNERWARE = ("20709", "餐具", "3", "20048")
    WINE_SET = ("20711", "酒壶/酒杯/酒具", "3", "20048")
    FOOD_CONTAINER = ("20766", "保鲜容器/保鲜器皿", "3", "20048")

    # 床上用品类
    BEDDING_BEDDING = ("20074", "床上用品", "3", "7")
    BEDDING_SLEEPING_BAG = ("20985", "睡袋", "3", "20074")
    COOLING_MAT = ("21036", "凉席", "3", "20074")
    BEDDING_BEDDING_SET = ("21273", "床品套件", "3", "20074")
    PILLOWCASE = ("20983", "枕套", "3", "20074")
    FITTED_SHEET = ("20979", "床笠", "3", "20074")
    BEDDING_BLANKET = ("21160", "休闲毯/毛毯/绒毯", "3", "20074")
    BEDDING_ACC = ("21274", "床品配件", "3", "20074")
    BED_SHEET = ("20976", "床单", "3", "20074")
    BEDDING_PILLOW = ("20982", "枕头", "3", "20074")
    DUVET_COVER = ("20987", "被套", "3", "20074")
    DISPOSABLE_BEDDING = ("37770", "一次性床品", "3", "20074")
    MATTRESS = ("21041", "床垫/床褥/床护垫/榻榻米床垫", "3", "20074")
    BEDDING_QUILT = ("20988", "被子", "3", "20074")
    BED_COVER = ("20980", "床罩", "3", "20074")
    BED_SPREAD = ("20978", "床盖", "3", "20074")
    KIDS_BEDDING = ("21272", "儿童床品", "3", "20074")
    BEDDING_MOSQUITO_NET = ("20986", "蚊帐", "3", "20074")
    CUSTOM_BEDDING = ("21331", "床品定制/定做", "3", "20074")
    BED_SKIRT = ("20981", "床裙", "3", "20074")
    PILLOW_TOWEL = ("20984", "枕巾", "3", "20074")
    BED_CURTAIN = ("20977", "床幔", "3", "20074")

    # 厨房电器类
    KITCHEN_APPLIANCE = ("20035,20065", "厨房电器", "3", "7")
    COOKING_TOOLS = ("20656", "烹饪用具", "3", "20035,20065")
    BBQ_TOOLS = ("20650", "烧烤/烘焙用具", "3", "20035,20065")
    KITCHEN_TOOLS = ("20667", "厨用小工具/厨房储物", "3", "20035,20065")
    BBQ_MACHINE = ("21168", "烤串机/电烤炉", "3", "20035,20065")
    OTHER_KITCHEN = ("27739", "其它厨房家电", "3", "20035,20065")
    COMMERCIAL_HEATING = ("21451", "商厨加热类设备", "3", "20035,20065")
    MEAT_GRINDER = ("21038", "绞肉/碎肉/绞菜机", "3", "20035,20065")
    PANCAKE_MAKER = ("21186", "电饼铛/可丽饼机/薄饼机", "3", "20035,20065")
    GRINDER = ("21187", "磨粉机/药材研磨机", "3", "20035,20065")
    EGG_COOKER = ("21169", "煮蛋器/蒸蛋器", "3", "20035,20065")
    BLENDER = ("21104", "破壁机", "3", "20035,20065")
    MIXER = ("21048", "搅拌/料理机", "3", "20035,20065")
    COFFEE_MACHINE = ("21095", "咖啡机", "3", "20035,20065")
    WATER_PURIFIER = ("21242", "净水设备", "3", "20035,20065")
    TEA_MACHINE = ("21170", "茶吧机/泡茶机", "3", "20035,20065")
    KETTLE = ("21244", "电热水壶", "3", "20035,20065")
    HEATING_CUP = ("21101", "电热杯", "3", "20035,20065")
    MICROWAVE = ("21097", "微波炉", "3", "20035,20065")
    RICE_COOKER = ("21103", "电饭煲", "3", "20035,20065")
    INDUCTION_COOKER = ("21156", "电磁炉/陶炉", "3", "20035,20065")
    FOOD_WARMER = ("21151", "暖菜板/保温碟", "3", "20035,20065")
    MULTI_COOKER = ("21395", "多功能料理锅", "3", "20035,20065")
    HEATING_LUNCH_BOX = ("21245", "电热饭盒", "3", "20035,20065")
    JUICER = ("21098", "榨汁机/原汁机", "3", "20035,20065")
    OTHER_COMMERCIAL = ("21391", "其它商用厨电", "3", "20035,20065")
    HEALTH_POT = ("21165", "养生壶/煎药壶", "3", "20035,20065")
    ELECTRIC_WOK = ("37698", "电火/煮/炒锅", "3", "20035,20065")
    SLOW_COOKER = ("21054", "电炖锅/煲汤锅/电炖盅", "3", "20035,20065")
    SOY_MILK = ("21105", "豆浆机", "3", "20035,20065")
    TEA_MAKER = ("21178", "电茶炉/煮茶器/奶茶机", "3", "20035,20065")
    AIR_FRYER = ("21246", "空气炸锅", "3", "20035,20065")
    OVEN = ("21100", "电烤箱", "3", "20035,20065")
    WATER_PUMP = ("21377", "电动抽水器/取水器", "3", "20035,20065")
    PRESSURE_COOKER = ("21243", "电压力锅", "3", "20035,20065")
    WATER_DISPENSER = ("21109", "饮水机", "3", "20035,20065")
    KITCHEN_ACC = ("21392", "厨房家电配件", "3", "20035,20065")
    STEAMER = ("21189", "电蒸锅/台式电蒸箱/肠粉机", "3", "20035,20065")
    WATER_FILTER = ("37699", "净水器及配件/耗材", "3", "20035,20065")

    # 智能设备类
    SMART_DEVICE = ("20081", "智能设备", "3", "14")
    SMART_WATCH = ("21296", "智能手表", "3", "20081")
    SMART_BAND = ("21295", "智能手环", "3", "20081")
    SMART_FLIGHT = ("32192", "智能飞行", "3", "20081")
    SMART_ACC = ("21424", "智能设备配件", "3", "20081")
    KIDS_WATCH = ("21422", "智能儿童手表", "3", "20081")

    # 影音电器类
    AUDIO_VIDEO = ("20075", "影音电器", "3", "14")
    SOUND_CARD = ("21275", "外置声卡", "3", "20075")
    AV_ACC = ("21411", "影音家电配件", "3", "20075")
    HEADPHONE = ("20990", "耳机", "3", "20075")
    SPEAKER = ("21019", "音箱/音响", "3", "20075")
    PLAYER = ("32421", "MP3/MP4/iPod/录音笔", "3", "20075")
    PORTABLE_AV = ("21185", "随身听/便携视听/收音", "3", "20075")
    MICROPHONE = ("21158", "麦克风/话筒", "3", "20075")
    AMPLIFIER = ("21172", "扩音器/录像机", "3", "20075")
    OTHER_AV = ("21408", "其它影音产品", "3", "20075")

    # 网络设备/数码存储类
    NETWORK_STORAGE = ("20101,20049", "网络设备/数码存储", "3", "14")
    ROUTER = ("21623", "路由器", "3", "20101,20049")
    FIBER_EQUIPMENT = ("21635", "光纤设备", "3", "20101,20049")
    MOBILE_NETWORK = ("21662", "4g/5g上网设备", "3", "20101,20049")
    SURVEILLANCE = ("21641", "视频监控", "3", "20101,20049")
    PHONE_USB = ("20820", "手机U盘", "3", "20101,20049")
    USB_DRIVE = ("20821", "普通U盘", "3", "20101,20049")
    MEMORY_CARD = ("20823", "闪存卡", "3", "20101,20049")

    # 移动电子设备类
    MOBILE_DEVICE = ("20007,20102,20087", "移动电子设备", "3", "14")
    SMARTPHONE = ("31860", "智能机", "3", "20007,20102,20087")
    FEATURE_PHONE = ("33930", "功能机", "3", "20007,20102,20087")
    DIGITAL_CAMERA = ("21679", "数码相机", "3", "20007,20102,20087")
    TABLET = ("31870", "平板电脑/MID", "3", "20007,20102,20087")

    # 电子教育类
    E_EDUCATION = ("20100", "电子教育", "3", "14")
    E_LEARNING = ("21634", "电子教育", "3", "20100")

    # 电玩游戏类
    GAMING = ("20024", "电玩游戏", "3", "14")
    GAME_SOFTWARE = ("20436", "游戏软件", "3", "20024")
    GAME_CONTROLLER = ("20434", "游戏手柄", "3", "20024")
    HANDHELD_GAME = ("20435", "游戏掌机", "3", "20024")
    SWITCH_ACC = ("20409", "任天堂 SWITCH配件", "3", "20024")
    OTHER_GAME_ACC = ("20433", "其他配件", "3", "20024")
    GAME_CONSOLE = ("20445", "家用游戏机", "3", "20024")

    # 电脑周边类
    PC_ACC = ("38116,38115", "电脑周边", "3", "14")
    MONITOR = ("21595", "显示器&支架", "3", "38116,38115")
    SSD = ("21598", "固态硬盘", "3", "38116,38115")
    LIVE_SOUND = ("21586", "K歌/直播声卡套装", "3", "38116,38115")
    WIRELESS_MOUSE = ("21599", "无线鼠标", "3", "38116,38115")
    WIRED_MOUSE = ("21600", "有线鼠标", "3", "38116,38115")
    PC_AV_ACC = ("21606", "电脑视听配件", "3", "38116,38115")
    KEYBOARD = ("21594", "键盘", "3", "38116,38115")
    KEYCAP = ("21593", "键帽", "3", "38116,38115")
    PC_PERIPHERAL = ("21602", "电脑周边", "3", "38116,38115")
    KB_MOUSE_SET = ("21603", "键鼠套装", "3", "38116,38115")

    # 大家电类
    LARGE_APPLIANCE = ("20044", "大家电", "3", "14")
    KITCHEN_LARGE = ("20748", "厨房大电", "3", "20044")
    WATER_HEATER = ("20734", "热水器", "3", "20044")
    LARGE_APP_ACC = ("20786", "大家电配件", "3", "20044")
    AIR_CONDITIONER = ("36416", "空调", "3", "20044")
    REFRIGERATOR = ("20702", "冰箱/冰吧/冰柜", "3", "20044")
    WASHING_MACHINE = ("36442", "洗衣机", "3", "20044")
    TV = ("36443", "电视", "3", "20044")

    # 办公用品类
    OFFICE_SUPPLIES = ("20095", "办公用品", "3", "14")
    TAPE = ("21533", "胶带", "3", "20095")
    OFFICE_ITEMS = ("21633", "办公用品", "3", "20095")
    SERVICES = ("21542", "服务类", "3", "20095")
    PRINTER_SUPPLIES = ("21555", "打印机耗材/配件", "3", "20095")
    PRINTER = ("32043", "打印机", "3", "20095")
    OFFICE_PAPER = ("32193", "办公用纸", "3", "20095")
    PROJECTOR_SUPPLIES = ("21557", "投影机耗材/配件", "3", "20095")
    PROJECTOR = ("21541", "投影机", "3", "20095")
    BINDING_SUPPLIES = ("32040", "装订耗材", "3", "20095")
    OFFICE_EQUIPMENT = ("21575", "办公设备配件及相关服务", "3", "20095")

    # 3C数码配件类
    DIGITAL_ACC = ("20000", "3C数码配件", "3", "14")
    PORTABLE_POWER = ("33500", "便携电源", "3", "20000")
    TABLET_ACC = ("20137", "平板电脑配件", "3", "20000")
    DIGITAL_PERIPHERAL = ("33501", "数码周边", "3", "20000")
    LAPTOP_ACC = ("33506", "笔记本电脑配件", "3", "20000")
    MP_ACC = ("33497", "MP3/MP4配件", "3", "20000")
    DIGITAL_STORAGE = ("20127", "数码包/收纳/整理", "3", "20000")
    USB_PERIPHERAL = ("33498", "USB数码周边", "3", "20000")
    PHOTO_EQUIPMENT = ("20126", "直播/摄影周边设备", "3", "20000")
    PHONE_ACC = ("20131", "手机配件", "3", "20000")
    BATTERY = ("33499", "干电池/充电电池/套", "3", "20000")

    # 农用物品类
    AGRICULTURAL = ("20016,20063", "农用物品", "3", "11")
    POST_PROCESSING = ("20365", "农产品采后加工/包装/贮藏", "3", "20016,20063")
    FARM_TOOLS = ("20346", "农业工具", "3", "20016,20063")
    IRRIGATION = ("20324", "喷灌/滴灌设备", "3", "20016,20063")
    GREENHOUSE_ACC = ("20362", "温室大棚配件", "3", "20016,20063")
    FARM_MACHINERY = ("33715", "农业机械", "3", "20016,20063")
    FARM_FILM = ("20316", "农膜/篷布/遮网/大棚", "3", "20016,20063")
    MICROBIAL = ("21348", "微生物菌剂", "3", "20016,20063")
    GARDEN_SUPPLIES = ("21388", "园林养护物资", "3", "20016,20063")
    ADDITIVES = ("21047", "助剂/添加剂", "3", "20016,20063")
    BIO_PRODUCTS = ("21387", "农业生物用品", "3", "20016,20063")
    FERTILIZER_1 = ("33714", "肥料", "3", "20016,20063")
    SEEDS = ("21012", "种子/种苗", "3", "20016,20063")
    FERTILIZER_2 = ("20948", "肥料", "3", "20016,20063")
    PESTICIDE = ("32191", "农药", "3", "20016,20063")

    # 鲜花速递/花卉仿真/绿植园艺类
    FLOWERS = ("20107", "鲜花速递/花卉仿真/绿植园艺", "3", "11")
    MEDICINAL_SEEDS = ("36725", "药材种子/种苗", "3", "20107")
    LOCAL_FLOWERS = ("21698", "鲜花速递(同城)", "3", "20107")
    BUSINESS_FLOWERS = ("21694", "商务用花", "3", "20107")
    TREES = ("32205", "果树/行道树", "3", "20107")
    HERB_SEEDLINGS = ("34584", "草本种苗", "3", "20107")
    CREATIVE_PLANTS = ("21709", "创意绿植/花卉/微景观", "3", "20107")
    VASES = ("32197", "花瓶/花器/花盆/花架", "3", "20107")
    PLANT_SEEDS = ("32203", "花卉/蔬果/草坪种子", "3", "20107")
    POTTED_PLANTS = ("32202", "花卉/绿植盆栽", "3", "20107")
    ARTIFICIAL_PLANTS = ("32201", "仿真花/绿植/蔬果成品", "3", "20107")
    PRESERVED_FLOWERS = ("32198", "永生花/干花", "3", "20107")
    GARDENING_SUPPLIES = ("32176", "园艺用品", "3", "20107")
    FLORAL_MATERIALS = ("32204", "花艺包装/材料", "3", "20107")
    WEDDING_FLOWERS = ("32200", "婚礼鲜花布置", "3", "20107")
    DAILY_FLOWERS = ("32199", "生活鲜花", "3", "20107")
    CARTOON_FLOWERS = ("21687", "卡通花/创意花", "3", "20107")

    # 畜牧/养殖物资类
    LIVESTOCK_LIVESTOCK = ("20037", "畜牧/养殖物资", "3", "11")
    FEED = ("20645", "饲料", "3", "20037")
    LIVESTOCK_EQUIPMENT = ("20655", "畜牧/养殖设备", "3", "20037")
    AQUACULTURE = ("20671", "水产养殖物资", "3", "20037")
    ANIMAL_HEALTH = ("20668", "动物保健品/水质调节剂", "3", "20037")
    BEEKEEPING = ("20672", "蜂场养殖物资", "3", "20037")
    VET_MEDICINE = ("20644", "兽用非处方药", "3", "20037")

    # 乐器配件类
    MUSICAL_ACC = ("20020", "乐器配件", "3", "2")
    MIDI = ("20385", "MIDI乐器/电脑音乐", "3", "20020")
    MUSIC_SERVICE = ("20414", "乐器服务", "3", "20020")
    MUSIC_SPEAKER = ("20416", "乐器音箱", "3", "20020")
    MUSIC_TOOLS = ("20440", "乐器工具/周边", "3", "20020")
    WESTERN_INSTRUMENT = ("20418", "西洋乐器", "3", "20020")
    INSTRUMENT_ACC = ("20415", "乐器配件", "3", "20020")
    TOY_INSTRUMENT = ("20450", "儿童玩具乐器", "3", "20020")
    SYNTHESIZER = ("20443", "电子合成器", "3", "20020")
    FOLK_INSTRUMENT = ("20417", "民族乐器", "3", "20020")
    PIANO = ("20391", "钢琴", "3", "20020")

    # 模玩/动漫/周边类
    TOYS_ANIME = ("20019", "模玩/动漫/周边/娃圈/三坑/桌游", "3", "2")
    GAME_MERCH = ("20380", "游戏实物周边", "3", "20019")
    MODEL_VEHICLE = ("20376", "车船模/军模/无人机/穿越机", "3", "20019")
    FIGURE = ("20369", "手办/兵人/扭蛋", "3", "20019")
    BLIND_BOX = ("20378", "潮玩盲盒", "3", "20019")
    ANIME_MERCH = ("20371", "卡通/动漫周边", "3", "20019")
    SCENE_PROPS = ("35213", "潮玩场景道具", "3", "20019")
    MODEL_TOOLS = ("20381", "模型制作工具/辅料耗材", "3", "20019")
    TOKUSATSU = ("35214", "特摄周边/模型/腰带/道具", "3", "20019")
    ARTIST_TOYS = ("36561", "艺术家潮玩", "3", "20019")
    BJD = ("20366", "BJD娃娃", "3", "20019")
    LOLITA = ("35212", "lolita/洛丽塔", "3", "20019")
    DOLL_CLOTHES = ("35215", "娃衣", "3", "20019")
    HANFU_COSPLAY = ("20382", "二次元古风服装", "3", "20019")
    GUNDAM = ("20375", "高达/机甲模型/机器人/变形类", "3", "20019")
    BOARD_GAMES = ("20368", "棋牌/桌游", "3", "20019")
    COSPLAY = ("20367", "Cosplay服饰/道具/服务", "3", "20019")
    PARTY_MAGIC = ("20370", "聚会/魔术/演出用品", "3", "20019")
    ANIME_LOLITA = ("20377", "二次元lolita", "3", "20019")
    PAPER_MODEL = ("20374", "纸模/纸质模型", "3", "20019")
    PRESALE_MODEL = ("34389", "预售模玩", "3", "20019")
    MOVIE_MERCH = ("20372", "影视/明星周边", "3", "20019")
    CULTURE_SPORTS = ("20373", "文化/体育周边", "3", "20019")

    # 玩具/童车/益智/积木/模型类
    TOYS = ("20025", "玩具/童车/益智/积木/模型", "3", "2")
    TOY_GUN = ("20482", "儿童玩具枪", "3", "20025")
    RC_PARTS = ("20489", "电动遥控玩具零件/工具", "3", "20025")
    BABY_TOYS = ("20477", "幼儿响铃/布玩/安抚玩具", "3", "20025")
    STEAM_TOYS = ("20455", "STEAM玩具/教具", "3", "20025")
    RC_MODEL = ("20487", "油动电动模型", "3", "20025")
    YOYO = ("20457", "悠悠(溜溜)球", "3", "20025")
    EARLY_EDUCATION = ("20466", "早教/智能玩具", "3", "20025")
    POOL_TOYS = ("20471", "游泳池/戏水玩具", "3", "20025")
    DRAWING = ("20483", "绘画类用品", "3", "20025")
    PLUSH_TOYS = ("20488", "毛绒布艺类玩具", "3", "20025")
    CRAWLING = ("20476", "幼儿爬行/学步/健身", "3", "20025")
    DIY_CRAFT = ("20479", "手工制作/创意DIY", "3", "20025")
    DOLLS = ("20458", "娃娃/配件", "3", "20025")
    PRETEND_PLAY = ("20469", "仿真/过家家玩具", "3", "20025")
    CLAY = ("20463", "彩泥/粘土/软陶泥", "3", "20025")
    SMART_TOYS = ("20486", "儿童智能玩具", "3", "20025")
    KIDS_VEHICLE = ("20467", "童车/儿童轮滑", "3", "20025")
    PUZZLE = ("20459", "串珠/拼图/配对/拆装/敲打玩具", "3", "20025")
    STATIC_MODEL = ("20474", "静态模型", "3", "20025")
    BRAIN_TEASER = ("20462", "解锁/迷宫/魔方/智力玩具", "3", "20025")
    KIDS_BAG = ("20470", "儿童包/背包/箱包", "3", "20025")
    ROBOT_TOYS = ("20484", "儿童机器人/变形/人偶玩具", "3", "20025")
    TOYS_PLAYGROUND = ("20468", "游乐/教学设备/大型设施", "3", "20025")
    RC_TOYS = ("20460", "电动/遥控/惯性/发条玩具", "3", "20025")
    BUILDING_BLOCKS = ("20456", "积木", "3", "20025")
    LEARNING_TOOLS = ("20464", "学习/实验/绘画文具", "3", "20025")
    CHESS_GAMES = ("20480", "儿童棋类/桌面游戏", "3", "20025")
    OUTDOOR_TOYS = ("20478", "户外运动/休闲/传统玩具", "3", "20025")
    MUSIC_TOYS = ("20481", "音乐玩具/儿童乐器", "3", "20025")
    ELECTRONIC_TOYS = ("20461", "电子/发光/充气/整蛊玩具", "3", "20025")
    BABY_SOUVENIR = ("20485", "宝宝纪念品/个性产品", "3", "20025")

    # 海鲜水产类
    SEAFOOD = ("38945", "海鲜水产", "3", "8")
    FRESH_CARD = ("20251", "生鲜卡券", "3", "38945")
    SEAFOOD_PRODUCTS = ("20250", "海鲜水产及制品", "3", "38945")

    # 肉蛋低温制品类
    MEAT_EGG = ("38946", "肉蛋低温制品", "3", "8")
    FROZEN_FOOD = ("31987", "冷藏/冷冻食品", "3", "38946")
    MEAT_PRODUCTS = ("20268", "猪牛羊禽肉及制品", "3", "38946")
    EGG_PRODUCTS = ("20173", "蛋/蛋制品", "3", "38946")
    READY_MEALS = ("32688", "方便菜", "3", "38946")

    # 水果蔬菜类
    FRUITS_VEGETABLES = ("38944", "水果蔬菜", "3", "8")
    VEGETABLES = ("20216", "蔬菜/蔬菜制品", "3", "38944")
    FRUITS = ("20188", "水果", "3", "38944")

    # 生活娱乐充值类
    ENTERTAINMENT_RECHARGE = ("20118", "生活娱乐充值", "3", "17")
    AUDIO_FM = ("22102", "音频FM", "3", "20118")
    VIDEO_MEMBERSHIP = ("22120", "影视会员", "3", "20118")
    OTHER_MEMBERSHIP = ("34526", "其他会员充值", "3", "20118")
    ACCOUNT_RECHARGE = ("22104", "账号充值/平台币", "3", "20118")
    KNOWLEDGE_READING = ("22121", "知识阅读", "3", "20118")
    NETWORK_TOOLS = ("22123", "网络工具", "3", "20118")

    # 手机号码/套餐/增值业务类
    MOBILE_SERVICE = ("20096", "手机号码/套餐/增值业务", "3", "17")
    BROADBAND = ("21550", "有线宽带", "3", "20096")
    NEW_NUMBER = ("21574", "新入网手机号套餐", "3", "20096")
    VALUE_ADDED = ("21568", "数据增值业务", "3", "20096")

    # 游戏服务类
    GAME_SERVICE = ("20097", "游戏服务", "3", "17")
    GAME_EQUIPMENT = ("21579", "游戏装备", "3", "20097")
    WEB_GAME_ITEMS = ("21582", "网页游戏物品/资源", "3", "20097")
    GAME_RECHARGE = ("22128", "游戏充值", "3", "20097")
    ACTIVATION_CODE = ("22107", "激活码/新手包", "3", "20097")

    # 医疗健康类
    MEDICAL_HEALTH = ("32625", "医疗健康", "3", "12")
    HEALTH_CHECK = ("32639", "健康体检", "3", "32625")

    # 教育培训类
    EDUCATION = ("20077", "教育培训", "3", "12")
    SKILL_TRAINING = ("21280", "技能培训", "3", "20077")
    GENERAL_INTEREST = ("21417", "常识兴趣", "3", "20077")
    LANGUAGE_TRAINING = ("21283", "语言培训", "3", "20077")
    QUALIFICATION_EXAM = ("21072", "学历/职业资格考试", "3", "20077")
    FAMILY_EDUCATION = ("21361", "家庭教育/中小学教育", "3", "20077")

    # 购物卡券类
    SHOPPING_CARDS = ("20113", "购物卡券", "3", "12")
    GIFT_CARDS = ("21725", "购物券/礼品卡", "3", "20113")

    # 生活服务类
    LIFE_SERVICE = ("20117", "生活服务", "3", "12")
    CONVENIENCE_SERVICE = ("22110", "便民服务", "3", "20117")

    # 翡翠玉石类
    JADE = ("20023", "翡翠玉石", "3", "20")
    JADEITE = ("20399", "翡翠", "3", "20023")
    AMBER = ("20429", "琥珀蜜蜡", "3", "20023")
    OTHER_JADE = ("20451", "其他天然玉石", "3", "20023")
    HETIAN_JADE = ("20407", "和田玉", "3", "20023")

    # 黄金/彩宝/钻石/珍珠类
    JEWELRY_JEWELRY = ("34020", "黄金/彩宝/钻石/珍珠", "3", "20")
    K_GOLD = ("20384", "k金（素款）", "3", "34020")
    CRYSTAL = ("23868", "天然水晶", "3", "34020")
    PRECIOUS_METAL = ("33810", "投资贵金属", "3", "34020")
    SYNTHETIC_GEM = ("20441", "人工宝石/合成宝石", "3", "34020")
    PEARL = ("20398", "珍珠", "3", "34020")
    SILVER = ("20400", "银饰", "3", "34020")
    COLORED_GEM = ("20442", "彩色宝石/贵重宝石", "3", "34020")
    PLATINUM = ("20402", "铂金/PT（素款）", "3", "34020")
    GOLD = ("20432", "足金首饰（素款）", "3", "34020")
    DIAMOND = ("20431", "钻石首饰", "3", "34020")

    # 手工艺/非遗技艺类
    HANDICRAFT = ("20110", "手工艺/非遗技艺", "3", "20")
    WEAVING = ("38933", "织染工艺", "3", "20110")
    OTHER_FOLK = ("38935", "其他民俗工艺", "3", "20110")
    PAPER_CUTTING = ("38934", "剪刻工艺", "3", "20110")
    REGIONAL_CRAFT = ("21734", "地区民间特色手工艺", "3", "20110")
    FIRING_CRAFT = ("38932", "烧造工艺", "3", "20110")
    LACQUER = ("38930", "髹饰（漆器）工艺", "3", "20110")
    SCULPTURE = ("20410", "雕塑工艺", "3", "20110")

    # 陶瓷/紫砂/建盏/茶周边类
    CERAMICS = ("20021", "陶瓷/紫砂/建盏/茶周边", "3", "20")
    JIAN_ZHAN = ("20392", "建盏", "3", "20021")
    CERAMIC_ACC = ("38936", "陶瓷周边", "3", "20021")
    OTHER_COLLECTION = ("20448", "其它收藏品", "3", "20021")
    TEA_WARE = ("20425", "茶道器具", "3", "20021")
    PURPLE_CLAY = ("20393", "紫砂", "3", "20021")
    POTTERY = ("20390", "陶/瓷/瓷片", "3", "20021")

    # 文玩/木作/书画/钱币类
    ANTIQUE = ("33691,34613", "文玩/木作/书画/钱币", "3", "20")
    HAND_PIECE = ("38941", "文玩把件", "3", "33691,34613")
    STONE_CARVING = ("33305", "石雕", "3", "33691,34613")
    HIGH_END_FURNITURE = ("20427", "高端家具", "3", "33691,34613")
    SEAL_CARVING = ("32661", "金石篆刻", "3", "33691,34613")
    THEME_COLLECTION = ("29723", "主题收藏", "3", "33691,34613")
    COINS = ("20395", "钱币", "3", "33691,34613")
    COLLECTION_TOOLS = ("20449", "收藏品保养/鉴定工具", "3", "33691,34613")
    SWORDS = ("28451", "刀剑相关", "3", "33691,34613")
    FLOWER_TOOLS = ("20437", "花道器具", "3", "33691,34613")
    INCENSE_TOOLS = ("33712", "香道器具", "3", "33691,34613")
    ANTIQUE_CALLIGRAPHY = ("20403", "书法/绘画", "3", "33691,34613")
    ANTIQUE_STATIONERY = ("20421", "文房用品", "3", "33691,34613")
    ROSEWOOD = ("33795", "红木家具", "3", "33691,34613")
    FUN_COLLECTION = ("20426", "趣味收藏", "3", "33691,34613")
    MINERAL = ("20412", "观赏石/奇石/矿物晶体", "3", "33691,34613")
    BODHI = ("33695", "菩提/核桃", "3", "33691,34613")
    GOURD = ("28406", "葫芦", "3", "33691,34613")
    AGARWOOD = ("32660", "沉香", "3", "33691,34613")
    METAL_WARE = ("20406", "金属/搪瓷器具", "3", "33691,34613")
    WOOD_STRING = ("32658", "文玩木串", "3", "33691,34613")
    ANTIQUE_ART = ("32662", "古董艺术品", "3", "33691,34613")

    def __init__(self, id: str, classify_name: str, cate_type: str, parent_id: str):
        self.id = id
        self.classify_name = classify_name
        self.cate_type = cate_type
        self.parent_id = parent_id
        self.category_selector = ".auxo-cascader-menus.auxo-cascader-menus-placement-bottomLeft:not(.auxo-cascader-menus-hidden)"

    @classmethod
    def get_by_id(cls, id: str) -> 'GoodsCategory':
        """根据ID获取商品类别"""
        for category in cls:
            if category.id == id:
                return category
        raise ValueError(f"未找到ID为{id}的商品类别")

    @classmethod
    def get_by_name(cls, name: str) -> 'GoodsCategory':
        """根据名称获取商品类别"""
        for category in cls:
            if category.classify_name == name:
                return category
        raise ValueError(f"未找到名称为{name}的商品类别")

    @classmethod
    def get_children(cls, parent_id: str) -> list['GoodsCategory']:
        """获取指定父ID的所有子类别"""
        return [category for category in cls if category.parent_id == parent_id]

    @classmethod
    def get_category_tree(cls) -> List[Dict]:
        """
        获取完整的分类树结构
        返回格式:
        [
            {
                "id": "顶级分类ID",
                "name": "顶级分类名称",
                "cate_type": "分类类型",
                "children": [
                    {
                        "id": "二级分类ID",
                        "name": "二级分类名称",
                        "cate_type": "分类类型",
                        "children": [
                            {
                                "id": "三级分类ID",
                                "name": "三级分类名称",
                                "cate_type": "分类类型"
                            }
                        ]
                    }
                ]
            }
        ]
        """

        def build_tree(parent_id: str) -> List[Dict]:
            children = cls.get_children(parent_id)
            result = []
            for child in children:
                category_dict = {
                    "id": child.id,
                    "name": child.name,
                    "cate_type": child.cate_type
                }
                sub_children = build_tree(child.id)
                if sub_children:
                    category_dict["children"] = sub_children
                result.append(category_dict)
            return result

        # 从顶级分类（parent_id = "0"）开始构建树
        return build_tree("0")

    @classmethod
    def get_parent_tree(cls, category_id: str) -> Dict:
        """
        根据分类ID获取其父节点树结构，包含当前节点
        如果是一级节点，则添加其所有子节点，并包含"不限"选项
        返回格式:
        {
            "id": "父级分类ID",
            "name": "父级分类名称", 
            "cate_type": "分类类型",
            "children": [
                {
                    "id": "当前分类ID",
                    "name": "当前分类名称",
                    "cate_type": "分类类型"
                }
            ]
        }
        """
        current_category = cls.get_by_id(category_id)

        # 构建当前节点
        current_node = {
            "id": current_category.id,
            "classify_name": current_category.classify_name,
            "cate_type": current_category.cate_type,
            "category_selector": current_category.category_selector
        }

        # 如果是一级节点（parent_id为"0"）
        if current_category.parent_id == "0":
            children = cls.get_children(current_category.id)
            # 添加"不限"选项作为第一个子节点
            current_node["children"] = [
                {
                    "id": current_category.id,
                    "classify_name": "不限",
                    "cate_type": current_category.cate_type,
                    "category_selector": current_category.category_selector
                }
            ]

            return current_node

        # 获取父节点
        parent = cls.get_by_id(current_category.parent_id)
        parent_node = {
            "id": parent.id,
            "classify_name": parent.classify_name,
            "cate_type": parent.cate_type,
            "children": [current_node],
            "category_selector": current_category.category_selector
        }

        # 如果父节点不是顶级节点，继续往上查找
        if parent.parent_id != "0":
            grandparent = cls.get_by_id(parent.parent_id)
            return {
                "id": grandparent.id,
                "classify_name": grandparent.classify_name,
                "cate_type": grandparent.cate_type,
                "children": [parent_node],
                "category_selector": current_category.category_selector
            }

        return parent_node


class AllianceSales30d(Enum):
    """月销量过滤枚举"""
    UNDER_500 = ("R:0,500", "500以下")
    ABOVE_500 = ("R:500,-", "≥500")
    ABOVE_1000 = ("R:1000,-", "≥1000")
    ABOVE_5000 = ("R:5000,-", "≥5000")
    ABOVE_10000 = ("R:10000,-", "≥1w")
    ABOVE_50000 = ("R:50000,-", "≥5w")
    ABOVE_100000 = ("R:100000,-", "≥10w")
    ABOVE_500000 = ("R:500000,-", "≥50w")
    ABOVE_1000000 = ("R:1000000,-", "≥100w")

    def __init__(self, classify_value: str, classify_name: str):
        self.classify_value = classify_value
        self.classify_name = classify_name
        self.field = "alliance_sales_30d"
        self.field_name = "月销"
        self.category_selector = ".auxo-select-dropdown.auxo-select-dropdown-placement-bottomLeft:not(.auxo-select-dropdown-hidden)"

    def to_dict(self) -> Dict:
        """返回枚举值的字典表示"""
        return {
            "classify_value": self.classify_value,
            "classify_name": self.classify_name,
            "field": self.field,
            "field_name": self.field_name,
            "category_selector": self.category_selector
        }


class BrowseCnt30d(Enum):
    """浏览量过滤枚举"""
    UNDER_500 = ("R:0,500", "500以下")
    ABOVE_500 = ("R:500,-", "≥500")
    ABOVE_1000 = ("R:1000,-", "≥1000")
    ABOVE_5000 = ("R:5000,-", "≥5000")
    ABOVE_10000 = ("R:10000,-", "≥1w")
    ABOVE_50000 = ("R:50000,-", "≥5w")
    ABOVE_100000 = ("R:100000,-", "≥10w")
    ABOVE_500000 = ("R:500000,-", "≥50w")
    ABOVE_1000000 = ("R:1000000,-", "≥100w")

    def __init__(self, classify_value: str, classify_name: str):
        self.classify_value = classify_value
        self.classify_name = classify_name
        self.field = "browse_cnt_30d"
        self.field_name = "浏览量"
        self.category_selector = ".auxo-select-dropdown.auxo-select-dropdown-placement-bottomLeft:not(.auxo-select-dropdown-hidden)"


class PromotionAuthorUcnt30d(Enum):
    """带货达人数过滤枚举"""
    UNDER_500 = ("R:0,500", "500以下")
    ABOVE_500 = ("R:500,-", "≥500")
    ABOVE_1000 = ("R:1000,-", "≥1000")
    ABOVE_5000 = ("R:5000,-", "≥5000")
    ABOVE_10000 = ("R:10000,-", "≥1w")
    ABOVE_50000 = ("R:50000,-", "≥5w")
    ABOVE_100000 = ("R:100000,-", "≥10w")
    ABOVE_500000 = ("R:500000,-", "≥50w")
    ABOVE_1000000 = ("R:1000000,-", "≥100w")

    def __init__(self, classify_value: str, classify_name: str):
        self.classify_value = classify_value
        self.classify_name = classify_name
        self.field = "promotion_author_ucnt_30d"
        self.field_name = "带货达人数"
        self.category_selector = ".auxo-select-dropdown.auxo-select-dropdown-placement-bottomLeft:not(.auxo-select-dropdown-hidden)"


class Price(Enum):
    """售价区间过滤枚举"""
    RANGE_0_10 = ("R:0,10", "￥0-￥10")
    RANGE_10_30 = ("R:10,30", "￥10-￥30")
    RANGE_30_50 = ("R:30,50", "￥30-￥50")
    RANGE_50_100 = ("R:50,100", "￥50-￥100")
    RANGE_100_500 = ("R:100,500", "￥100-￥500")
    ABOVE_500 = ("R:500,-", "≥￥500")

    def __init__(self, classify_value: str, classify_name: str):
        self.classify_value = classify_value
        self.classify_name = classify_name
        self.field = "Price"
        self.field_name = "售价区间"
        self.category_selector = ".auxo-select-dropdown.auxo-select-dropdown-placement-bottomLeft:not(.auxo-select-dropdown-hidden)"


class CosRatio(Enum):
    """佣金区间过滤枚举"""
    RANGE_0_10 = ("R:0,10", "0%-10%")
    RANGE_10_20 = ("R:10,20", "10%-20%")
    RANGE_20_30 = ("R:20,30", "20%-30%")
    RANGE_30_40 = ("R:30,40", "30%-40%")
    RANGE_40_50 = ("R:40,50", "40%-50%")
    ABOVE_50 = ("R:50,-", "≥50%")

    def __init__(self, classify_value: str, classify_name: str):
        self.classify_value = classify_value
        self.classify_name = classify_name
        self.field = "CosRatio"
        self.field_name = "佣金区间"
        self.category_selector = ".auxo-select-dropdown.auxo-select-dropdown-placement-bottomLeft:not(.auxo-select-dropdown-hidden)"


class ExpScore(Enum):
    """商家体验分过滤枚举"""
    ABOVE_80 = ("80", "80分以上")
    ABOVE_85 = ("85", "85分以上")
    ABOVE_90 = ("90", "90分以上")
    ABOVE_95 = ("95", "95分以上")

    def __init__(self, classify_value: str, classify_name: str):
        self.classify_value = classify_value
        self.classify_name = classify_name
        self.field = "ExpScore"
        self.field_name = "商家体验分"
        self.category_selector = ".auxo-select-dropdown.auxo-select-dropdown-placement-bottomLeft:not(.auxo-select-dropdown-hidden)"


class PositiveRate(Enum):
    """好评率过滤枚举"""
    ABOVE_80 = ("80", "≥80%")
    ABOVE_85 = ("85", "≥85%")
    ABOVE_90 = ("90", "≥90%")
    ABOVE_95 = ("95", "≥95%")

    def __init__(self, classify_value: str, classify_name: str):
        self.classify_value = classify_value
        self.classify_name = classify_name
        self.field = "PositiveRate"
        self.field_name = "好评率"
        self.category_selector = ".auxo-select-dropdown.auxo-select-dropdown-placement-bottomLeft:not(.auxo-select-dropdown-hidden)"

class Insurance(Enum):
    """服务与权益过滤枚举"""
    FREE_SAMPLE = ("SHENYANG", "免费申样")
    FREE_SHIPPING = ("FREIGHTFREE", "包邮")
    SHIPPING_INSURANCE = ("YUNFEIXIAN", "运费险")
    FREE_PROMOTION = ("SUIXINTUI", "短视频随心推")
    AUTHENTIC = ("Authoried_books", "正品溯源")

    def __init__(self, classify_value: str, classify_name: str):
        self.classify_value = classify_value
        self.classify_name = classify_name
        self.field = "Insurance"
        self.field_name = "服务与权益"
        self.category_selector = ".auxo-select-dropdown.auxo-select-dropdown-placement-bottomLeft:not(.auxo-select-dropdown-hidden)"

class FeaturedItems(Enum):
    """特色货品过滤枚举"""
    POPULAR = ("10010003", "口碑优选")
    BRAND = ("PINPAI", "品牌")
    NEW = ("is_first_onshelf_prod_30d", "新品")
    CHEAP = ("10030001", "低价好货")

    def __init__(self, classify_value: str, classify_name: str):
        self.classify_value = classify_value
        self.classify_name = classify_name
        self.field = "FeaturedItems"
        self.field_name = "特色货品"
        self.category_selector = ""

def to_dict(enum_class) -> Dict:
    """返回枚举值的字典表示"""
    return {
        "classify_value": enum_class.classify_value,
        "classify_name": enum_class.classify_name,
        "field": enum_class.field,
        "field_name": enum_class.field_name,
        "category_selector": enum_class.category_selector
    }
def get_cate_by_id(enum_class, classify_value: str):
    """
    通用方法,根据classify_value获取对应枚举类的实例

    Args:
        enum_class: 枚举类
        classify_value: 分类值

    Returns:
        对应的枚举实例

    Raises:
        ValueError: 当找不到对应的枚举值时抛出
    """
    for item in enum_class:
        if item.classify_value == classify_value:
            if item.field == 'FeaturedItems':
                return to_dict(item)
            else:
                parent_node = {
                    "classify_value": item.classify_value,
                    "classify_name": item.field_name,
                    "children": [to_dict(item)],
                    "category_selector": item.category_selector
                }
                return parent_node

    raise ValueError(f"未找到classify_value为{classify_value}的{enum_class.__name__}枚举值")

if __name__ == '__main__':
    tree = GoodsCategory.get_parent_tree("21766")  # 洗护清洁
    print(tree)
